package icepbru.kittipongnuanyai.pbru1;

/**
 * Created by kittipongnuanyai on 1/19/2018 AD.
 */

public class MyData {

    public String[] name() {

        String[] strName = new String[24];
        strName[0] = "سورة الفاتحة";
        strName[1] = "سورة و-ناس";
        strName[2] = "سورة الفلق";
        strName[3] = "سورة الإخلاص";
        strName[4] = "سورة المسد";
        strName[5] = "سورة النصر";
        strName[6] = "سورة الكافرون";
        strName[7] = "سورة الكوثر";
        strName[8] = "سورة الماعون";
        strName[9] = "سورة آل قريش";
        strName[10] = "سورة الفيل";
        strName[11] = "سورة لُمَزة";
        strName[12] = "سورة العصر";
        strName[13] = "سورة التكاثر";
        strName[14] = "سورة لْقَارِعة";
        strName[15] = "سورة العاديات";
        strName[16] = "سورة الزلزلة";
        strName[17] = "سورة الْبينة";
        strName[18] = "سورة القدر";
        strName[19] = "سورة العلق";
        strName[20] = "سورة التين";
        strName[21] = "سورة آل الشرح";
        strName[22] = "سورة الضحى";
        strName[23] = "سورة ياسين";


        return strName;

    }


    public String[] detail() {
        String[] strDetail = new String[24];
        strDetail[0] = "1.ซูเราะฮฺ อัล-ฟาติหะฮฺ";
        strDetail[1] = "2.ซูเราะฮฺ อันนาส";
        strDetail[2] = "3.ซูเราะฮฺ อัลฟะลัก";
        strDetail[3] = "4.ซูเราะฮฺ อัลอิคลาส";
        strDetail[4] = "5.ซูเราะฮฺ อัลมะซัด";
        strDetail[5] = "6.ซูเราะฮฺ อัลนัศรฺ";
        strDetail[6] = "7.ซูเราะฮฺ อัลกาฟิรูน";
        strDetail[7] = "8.ซูเราะฮฺ อัลเกาซัร";
        strDetail[8] = "9.ซูเราะฮฺ อัลมาอูน";
        strDetail[9] = "10.ซูเราะฮฺ อักุรอยซฺ";
        strDetail[10] = "11.ซูเราะฮฺ อัลฟีล";
        strDetail[11] = "12.ซูเราะฮฺ อัลฮุมะซะฮฺ";
        strDetail[12] = "13.ซูเราะฮฺ อัลอัศรฺ ";
        strDetail[13] = "14.ซูเราะฮฺ อัตตะกาซุร";
        strDetail[14] = "15.ซูเราะฮฺ อัลกอริอะฮฺ ";
        strDetail[15] = "16.ซูเราะฮฺ อัลอาดิยาต";
        strDetail[16] = "17.ซูเราะฮฺ อัลซัลซะละฮฺ ";
        strDetail[17] = "18.ซูเราะฮฺ อัลบัยยินะฮฺ";
        strDetail[18] = "19.ซูเราะฮฺ อัลก็อดร ";
        strDetail[19] = "20.ซูเราะฮฺ อัลอะลัก";
        strDetail[20] = "21.ซูเราะฮฺ อัตตีน";
        strDetail[21] = "22.ซูเราะฮฺ อัลอินซิรอฮฺ";
        strDetail[22] = "23.ซูเราะฮฺ อัฎฎุฮา";
        strDetail[23] = "24.ซูเราะฮฺ ยาซีน ";



        return strDetail;
    }


    public String[] mess() {

        String[] strMess = new String[24];
        strMess[0] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِين"+"\r\nการสรรเสริญทั้งหลายนั้น เป็นสิทธิของอัลลอฮฺผู้เป็นพระเจ้าแห่งสากลโลก\r\n\r\n"+
                     "الرَّحْمَٰنِ الرَّحِيمِ"+"\r\nผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"مَالِكِ يَوْمِ الدِّين"+"\r\nผู้ทรงอภิสิทธิ์แห่งวันตอบแทน\r\n\r\n"+
                     "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ"+"\r\nเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์เคารพอิบาดะฮฺ และเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์ขอความช่วยเหลือ\r\n\r\n"+ "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ"+"\r\nขอพระองค์ทรงแนะนำพวกข้าพระองค์ซึ่งทางอันเที่ยงตรง\r\n\r\n"+
                     "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"+"\r\n(คือ) ทางของบรรดาผู้ที่พระองค์ได้ทรงโปรดปราณแก่พวกเขา มิใช่ในทางของพวกที่ถูกกริ้ว และมิใช่ทางของพวกที่หลงผิด"
        ;
        strMess[1] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"قُلْ أَعُوذُ بِرَبِّ النَّاسِ"+"\r\nจงกล่าวเถิด มุฮัมมัด ข้าพระองค์ขอความคุ้มครองต่อพระเจ้าแห่งมนุษย์ชาติ\r\n\r\n"+
                     "مَلِكِ النَّاسِ"+"\r\nพระราชาแห่งมนุษย์ชาติ\r\n\r\n"+"إِلَٰهِ النَّاسِ"+"\r\nพระเป็นเจ้าแห่งมนุษย์ชาติ\r\n\r\n"+"مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"+ "\r\nให้พ้นจากความชั่วร้ายของผู้กระซิบกระซาบที่หลอกล่อ\r\n\r\n"+
                     "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"+"\r\nที่กระซิบกระซาบในหัวอกของมนุษย์\r\n\r\n"+"مِنَ الْجِنَّةِ وَالنَّاسِ"+"\r\nจากหมู่ญินและมนุษย์";

        strMess[2] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ"+"\r\nจงกล่าวเถิด มุฮัมมัด ข้าพระองค์ขอความคุ้มครองต่อพระเจ้าแห่งรุ่งอรุณ\r\n\r\n"+
                     "مِن شَرِّ مَا خَلَقَ"+"\r\nให้พ้นจากความชั่วร้ายที่พระองค์ได้ทรงบันดาลขึ้น\r\n\r\n"+ "وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ"+"\r\nและจากความชั่วร้ายแห่งความมืดของเวลากลางคืนเมื่อมันแผ่คลุม\r\n\r\n"+
                     "وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ"+"\r\nและจากความชั่วร้ายของบรรดาผู้เสกเป่าในปมเงื่อน\r\n\r\n"+"وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ"+"\r\nและจากความชั่วร้ายของผู้อิจฉาเมื่อเขาอิจฉา";

        strMess[3] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"قُلْ هُوَ اللَّهُ أَحَدٌ"+"\r\nจงกล่าวเถิด มุฮัมมัด พระองค์คืออัลลอฮฺผู้ทรงเอกะ\r\n\r\n"+
                     "للَّهُ الصَّمَدُ"+"\r\nอัลลอฮฺนั้นทรงเป็นที่พึ่ง\r\n\r\n"+"لَمْ يَلِدْ وَلَمْ يُولَدْ"+"\r\nพระองค์ไม่ประสูติ และไม่ทรงถูกประสูติ\r\n\r\n"+ "وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ"+"\r\nและไม่มีผู้ใดเสมอเหมือนพระองค์";

        strMess[4] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ"+"\r\nมือทั้งสองของอะบีละฮับจงพินาศ และเขาก็พินาศแล้ว\r\n\r\n"+
                     "مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ"+"\r\nทรัพย์สมบัติของเขา และสิ่งที่เขาได้ขวนขวายไว้นั้นมิได้อำนวยประโยชน์แก่เขาเลย\r\n\r\n"+"سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ"+"\r\nเขาจะเข้าไปเผาไหม้ในนรกที่มีไฟลุกโชน\r\n\r\n"+
                     "وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ"+"\r\nทั้งภริยาของเขาด้วย นางเป็นผู้แบกฟืน\r\n\r\n"+"فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ"+"\r\nที่คอของนางมีเชือกถักด้วยใยอินทผลัม";

        strMess[5] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ"+"\r\nเมื่อความช่วยเหลือของอัลลอฮฺ และการพิชิตได้มาถึงแล้ว\r\n\r\n"+
                     "وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا"+"\r\nและเจ้าได้เห็นประชาชนเข้าในศาสนาของอัลลอฮฺเป็นหมู่ ๆ\r\n\r\n"+ "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا"+"\r\nดังนั้นจงแซ่ซ้องสดุดีด้วยการสรรเสริญพระเจ้าของเจ้า และจงขออภัยโทษต่อพระองค์เถิด แท้จริงพระองค์นั้นเป็นผู้ทรงอภัยโทษเสมอ";

        strMess[6] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"قُلْ يَا أَيُّهَا الْكَافِرُونَ"+"\r\nจงกล่าวเถิด มุฮัมมัดว่า โอ้บรรดาผู้ปฏิเสธศรัทธาเอ๋ย\r\n\r\n"+
                     "لَا أَعْبُدُ مَا تَعْبُدُونَ"+"\r\nฉันจะไม่เคารพภักดีสิ่งที่พวกท่านเคารพภักดีอยู่\r\n"+"وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ"+"\r\nและพวกท่านก็ไม่ใช่เป็นผู้เคารพภักดีพระเจ้าที่ฉันเคารพภักดี\r\n\r\n"+
                     "وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ "+"\r\nและฉันก็มิใช่เป็นผู้เคารพภักดีสิ่งที่พวกท่านเคารพภักดี\r\n\r\n"+ "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ"+"\r\nและพวกท่านก็มิใช่เป็นผู้เคารพภักดีพระเจ้าที่ฉันเคารพภักดี\r\n\r\n"+
                     "لَكُمْ دِينُكُمْ وَلِيَ دِينِ"+"\r\nสำหรับพวกท่านก็คือศาสนาของพวกท่าน และสำหรับฉันก็คือศาสนาของฉัน";

        strMess[7] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ"+"\r\nแท้จริงเราได้ประทานอัลเกาซัรแก่เจ้าแล้ว\r\n\r\n"+
                     "فَصَلِّ لِرَبِّكَ وَانْحَرْ "+"\r\nดังนั้นเจ้าจงละหมาดเพื่อพระเจ้าของเจ้าและจงเชือดสัตว์พลี\r\n\r\n"+"إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ"+"\r\nแท้จริงศัตรูของเจ้านั้นเขาเป็นผู้ถูกตัดขาด";

        strMess[8] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ"+"\r\nเจ้าเห็นแล้วมิใช่หรือ ผู้ที่ปฏิเสธการตอบแทน (ในปรโลก)\r\n\r\n"+
                     "فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ"+"\r\nนั่นก็คือผู้ที่ขับไล่เด็กกำพร้า\r\n\r\n"+"وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ"+"\r\nและไม่สนับสนุนในการให้อาหารแก่ผู้ขัดสน\r\n\r\n"+
                     "فَوَيْلٌ لِّلْمُصَلِّينَ" + "\r\nดังนั้น ความหายนะจงมีแด่บรรดาผู้ทำละหมาด\r\n\r\n"+ "الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ"+"\r\nผู้ที่พวกเขาละเลยต่อการละหมาดของพวกเขา\r\n\r\n"+
                     "الَّذِينَ هُمْ يُرَاءُونَ"+"\r\nผู้ที่พวกเขาโอ้อวดกัน\r\n\r\n"+"وَيَمْنَعُونَ الْمَاعُونَ"+"\r\nและพวกเขาหวงแหนเครื่องใช้เล็ก ๆ น้อย ๆ (แก่เพื่อนบ้าน)";

        strMess[9] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"لِإِيلَافِ قُرَيْشٍ"+"\r\nเพื่อให้ความคุ้นเคยแก่ชาวกุเรช\r\n\r\n"+
                     "إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ"+"\r\nเพื่อให้ความคุ้นเคยแก่พวกเขาในการเดินทางในฤดูหนาว (ไปเยเมน) และฤดูร้อน (ไปชาม)\r\n\r\n"+"فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ"+"\r\nดังนั้น จงให้พวกเขาเคารพภักดีพระเจ้าแห่งบ้านหลังนี้เถิด (คืออัลกะอฺบะฮฺ)\r\n\r\n"+
                     "الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ"+"\r\nผู้ทรงให้อาหารแก่พวกเขาให้พ้นจากความหิว และทรงให้ความปลอดภัยแก่พวกเขาให้พ้นจากความหวาดกลัว";

        strMess[10] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ"+"\r\nเจ้าไม่เห็นดอกหรือว่า พระเจ้าของเจ้าได้กระทำกับพวกเจ้าของช้างอย่างไร?\r\n\r\n"+
                      "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ"+"\r\nพระองค์มิได้ทรงทำให้แผนการณ์ของพวกเขาสูญสิ้นดอกหรือ ?\r\n\r\n"+"وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ"+"\r\nและได้ทรงส่งนกเป็นฝูง ๆ ลงมาบนพวกเขา\r\n\r\n"+
                      "تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ "+"\r\nมันได้ขว้างพวกเขาด้วยหินที่ทำด้วยดินแข็ง\r\n\r\n"+"فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ"+"\r\nแล้วพระองค์ทรงทำให้พวกเขาเป็นเช่นใบไม้ที่ถูก (สัตว์) กิน";

        strMess[11] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ "+"\r\nความหายนะจงประสบแด่ทุกผู้นินทาและผู้ใส่ร้ายผู้อื่น\r\n\r\n"+
                      "الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ "+"\r\nซึ่งเขาสะสมทรัพย์สมบัติและหมั่นนับมันอยู่เสมอ\r\n\r\n"+"يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ"+"\r\nโดยคิดว่าทรัพย์สมบัติของเขานั้นจะทำให้เขาอยู่ได้ตลอดไป\r\n\r\n"+
                      "كَلَّا ۖ لَيُنبَذَنَّ فِي الْحُطَمَةِ"+"\r\nมิใช่เช่นนั้น แน่นอนเขาจะถูกโยนลงไปในไฟนรก (อัลฮุเฏามะฮฺ)\r\n\r\n"+"وَمَا أَدْرَاكَ مَا الْحُطَمَةُ"+"\r\nและอะไรเล่าที่ทำให้เจ้ารู้ได้ว่า ไฟนรก (อัลฮุเฏาะมะฮฺ) นั้นคืออะไร?\r\n\r\n"+
                      "نَارُ اللَّهِ الْمُوقَدَةُ"+"\r\nคือไฟของอัลลอฮฺที่ถูกจุดให้ลุกโชน\r\n\r\n"+ "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ"+"\r\nซึ่งมันจะลุกไหม้เข้าไปในหัวใจ\r\n\r\n"+"إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ"+"\r\nแท้จริงมันจะลุกไหม้คลุมบนพวกเขาอย่างมิดชิด\r\n\r\n"+
                      "فِي عَمَدٍ مُّمَدَّدَةٍ"+"\r\nอยู่ในสภาพของเสาสูงชะลูด";

        strMess[12] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَالْعَصْرِ"+"\r\nขอสาบานด้วยกาลเวลา\r\n\r\n"+"إِنَّ الْإِنسَانَ لَفِي خُسْرٍ"+"\r\nแท้จริงมนุษย์นั้น อยู่ในการขาดทุน\r\n\r\n"+
                      "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ"+"\r\nนอกจากบรรดาผู้ศรัทธาและกระทำความดีทั้งหลาย และตักเตือนกันและกันในสิ่งที่เป็นสัจธรรม และตักเตือนกันและกันให้มีความอดทน";

        strMess[13] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"أَلْهَاكُمُ التَّكَاثُرُ"+"\r\nการสะสมทรัพย์สมบัติเพื่ออวดอ้างได้ทำให้พวกเจ้าเพลิดเพลิน\r\n\r\n"+
                      "حَتَّىٰ زُرْتُمُ الْمَقَابِرَ"+"\r\nจนกระทั่งพวกเจ้าได้เข้าไปเยือนหลุมฝังศพ\r\n\r\n"+"كَلَّا سَوْفَ تَعْلَمُونَ "+"\r\nเปล่าเลย พวกเจ้าจะได้รู้\r\n\r\n"+"ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ"+"\r\nแล้วก็เปล่าเลย พวกเจ้าจะได้รู้\r\n\r\n"+
                      "كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ"+"\r\nมิใช่เช่นนั้น ถ้าพวกเจ้าได้รู้อย่างแท้จริงแล้ว\r\n\r\n"+"لَتَرَوُنَّ الْجَحِيمَ"+"\r\nแน่นอน พวกเจ้าจะเห็นไฟที่ลุกโชน\r\n\r\n"+
                      "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ"+"\r\nแล้วแน่นอนพวกเจ้าจะได้เห็นมัน ด้วยสายตาที่แน่ชัด\r\n\r\n"+"ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ"+"\r\nแล้วในวันนั้นพวกเจ้าจะถูกสอบถามเกี่ยวกับความโปรดปรานที่ได้รับ (ในโลกดุนยา)";

        strMess[14] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"الْقَارِعَةُ "+"\r\nอัลกอริอะฮ์\r\n\r\n"+"مَا الْقَارِعَةُ "+"\r\nอัลกอริอะฮ์นั้นคืออะไร?\r\n\r\n"+
                      "وَمَا أَدْرَاكَ مَا الْقَارِعَةُ"+"\r\nและอะไรที่ทำให้เจ้าได้รู้ว่าอัลกอรีอะฮฺนั้นคืออะไร?\r\n\r\n"+"يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ"+"\r\nวันที่มนุษย์จะเป็นเช่นแมลงเม่าที่กระจายว่อน\r\n\r\n"+
                      "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنفُوشِ"+"\r\nและบรรดาภูเขาจะเป็นเช่นขนสัตว์ที่ปลิวว่อน\r\n\r\n"+"فَأَمَّا مَن ثَقُلَتْ مَوَازِينُهُ "+"\r\nส่วนผู้ที่ตราชูของเขาหนัก\r\n\r\n"+ "فَهُوَ فِي عِيشَةٍ رَّاضِيَةٍ"+"\r\nเขาก็จะอยู่ในการมีชีวิตที่ผาสุข\r\n\r\n"+
                      "وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ"+"\r\nและส่วนผู้ที่ตราชูของเขาเบา\r\n\r\n"+"فَأُمُّهُ هَاوِيَةٌ"+"\r\nที่พำนักของเขาก็คือเหวลึก (ฮาวิยะฮ์)\r\n\r\n"+ "وَمَا أَدْرَاكَ مَا هِيَهْ"+"\r\nและอะไรเล่าที่ทำให้เจ้ารู้ได้ว่าเหวลึกคืออะไร?\r\n\r\n"+
                      "نَارٌ حَامِيَةٌ"+"\r\nคือไฟอันร้อนแรง";

        strMess[15] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَالْعَادِيَاتِ ضَبْحًا"+"\r\nขอสาบานด้วยม้าที่วิ่งหอบฮัก ๆ\r\n\r\n"+
                      "فَالْمُورِيَاتِ قَدْحًا"+"\r\nแล้วด้วยม้าที่กลีบเท้าของมันตีกับหินจนเกิดประกายไฟ\r\n\r\n"+"فَالْمُغِيرَاتِ صُبْحًا"+"\r\nแล้วด้วยม้าที่จู่โจมศัตรูในยามเช้า\r\n\r\n"+"فَأَثَرْنَ بِهِ نَقْعًا  "+"\r\nแล้วมันได้ทำให้ฝุ่นตลบฟุ้งในยามนั้น\r\n\r\n"+
                      "فَوَسَطْنَ بِهِ جَمْعًا "+"\r\nแล้วมันได้บุกเข้าไปท่ามกลางหมู่ศัตรูในยามนั้น\r\n\r\n"+"إِنَّ الْإِنسَانَ لِرَبِّهِ لَكَنُودٌ"+"\r\nแท้จริงมนุษย์เป็นผู้เนรคุณต่อพระเจ้าของเขา\r\n\r\n"+
                      "وَإِنَّهُ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ"+"\r\nและแท้จริงเขาได้เป็นพยานต่อการนั้นอย่างแน่นอน\r\n\r\n"+"وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ"+"\r\nและแท้จริงเขามีความหวงแหน เพราะรักในทรัพย์สมบัติ\r\n\r\n"+
                      "أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ "+"\r\nเขาไม่รู้ดอกหรือว่า เมื่อสิ่งที่อยู่ในหลุมฝังศพถูกให้ฟื้นขึ้นมา\r\n\r\n"+ "وَحُصِّلَ مَا فِي الصُّدُورِ "+"\r\nและสิ่งที่อยู่ในหัวอกถูกเผยออก\r\n\r\n"+
                      "إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌ "+"\r\nแท้จริงพระเจ้าของพวกเขาในวันนั้น ทรงตระหนักในพวกเขาอย่างแน่นอน";

        strMess[16] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا"+"\r\nเมื่อแผ่นดินถูกให้ไหวอย่างสั่นสะท้านของมัน\r\n\r\n"+
                      "وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا"+"\r\nและเมื่อแผ่นดินได้ระบายของหนักของมันออกมา\r\n\r\n"+"وَقَالَ الْإِنسَانُ مَا لَهَا "+"\r\nและมนุษย์จะกล่าวว่า เกิดอะไรขึ้นแก่มันเล่า\r\n\r\n"+
                      "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا "+"\r\nในวันนั้นมันจะบอกข่าวคราวของมัน\r\n\r\n"+"بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا"+"\r\nว่าแท้จริงพระเจ้าได้มีบัญชาแก่มัน\r\n\r\n"+
                      "يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِّيُرَوْا أَعْمَالَهُمْ"+"\r\nในวันนั้นมนุษย์จะกระจายออกมาเป็นหมู่ ๆ เพื่อพวกเขาจะถูกให้เห็นผลงานของพวกเขา\r\n\r\n"+
                      "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ"+"\r\nดังนั้นผู้ใดกระทำความดีหนักเท่าละอองธุลี เขาก็จะเห็นมัน\r\n\r\n"+"وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ "+"\r\nส่วนผู้ใดกระทำความชั่วหนักเท่าละอองธุลีเขาก็จะเห็นมัน";

        strMess[17] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+
                      "مْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ"+"\r\nบรรดาผู้ปฏิเสธศรัทธาในหมู่อะฮฺลุลกิตาบและพวกบูชาเจว็ดนั้นจะไม่พ้นจาก (หลักศรัทธาของพวกเขา) จนกว่าจะได้มีหลักฐานอันชัดแจ้งมายังพวกเขา\r\n\r\n"+
                      "رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً "+"\r\nคือร่อซูลคนหนึ่งจากอัลลอฮฺเพื่ออ่านคัมภีร์อันบริสุทธิ์\r\n\r\n"+"فِيهَا كُتُبٌ قَيِّمَةٌ"+"\r\nในคัมภีร์นั้นมีบัญญัติอันเที่ยงตรง\r\n\r\n"+
                      "وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ"+"\r\nและบรรดาผู้ที่ได้รับคัมภีร์ (อะฮฺลุลกิตาบ) นั้น มิได้แตกแยกกัน เว้นแต่หลังจากที่ได้มีหลักฐานอันชัดแจ้งมายังพวกเขาแล้ว\r\n\r\n"+
                      "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ"+"\r\nและพวกเขามิได้ถูกบัญชาให้กระทำอื่นใดนอกจากเพื่อเคารพภักดีต่ออัลลอฮฺ เป็นผู้มีเจตนาบริสุทธิ์ในการภักดีต่อพระองค์ เป็นผู้อยู่ในแนวทางที่เที่ยงตรงและดำรงการละหมาด และจ่ายซะกาต และนั่นแหละคือศาสนาอันเที่ยงธรรม\r\n\r\n"+
                      "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ "+"\r\nแท้จริงบรรดาผู้ปฏิเสธศรัทธาในหมู่อะฮฺลุลกิตาบและบูชาเจว็ดนั้นจะอยู่ในนรกญะฮันนัม พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล ชนเหล่านั้นพวกเขาเป็นมนุษย์ที่ชั่วช้ายิ่ง\r\n\r\n"+
                      "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ"+"\r\nแท้จริง บรรดาผู้ศรัทธาและประกอบความดีทั้งหลาย ชนเหล่านั้น พวกเขาเป็นมนุษย์ที่ดียิ่ง\r\n\r\n"+
                      "جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ"+"\r\nการตอบแทนของพวกเขา ณ ที่พระเจ้าของพวกเขาคือสวนสวรรค์หลากหลายอันสถาพร ณ เบื้องล่างของมันมีลำน้ำหลายสายไหลผ่าน พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล อัลลอฮฺทรงปิติต่อพวกเขา และพวกเขาก็ยินดีในพระองค์ นั่นคือสำหรับผู้ที่กลัวเกรงพระเจ้าของพวกเขา";

        strMess[18] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ"+"\r\nแท้จริงเราได้ประทานอัลกุรอานลงมาในคืนอัลก็อดรฺ\r\n\r\n"+
                      "وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ"+"\r\nและอะไรเล่าจะทำให้เจ้ารู้ได้ว่าคืนอัลก็อดรฺนั้นคืออะไร\r\n\r\n"+"لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ"+"\r\nคืนอัลก็อดรฺนั้นดียิ่งกว่าหนึ่งพันเดือน\r\n\r\n"+
                      "تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ "+"\r\nบรรดามะลาอิกะฮฺและอัลรูฮฺ (ญิบริล) จะลงมาในคืนนั้น โดยอนุมัติแห่งพระเจ้าของพวกเขาเนื่องจากกิจการ-ทุกสิ่ง\r\n\r\n"+
                      "سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ"+"\r\nคืนนั้นมีความศานติจนกระทั่งรุ่งอรุณ";

        strMess[19] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ"+"\r\nจงอ่านด้วยพระนามแห่งพระเจ้าของเจ้าผู้ทรงบังเกิด\r\n\r\n"+
                      "خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ"+"\r\nทรงบังเกิดมนุษย์จากก้อนเลือด\r\n\r\n"+"اقْرَأْ وَرَبُّكَ الْأَكْرَمُ"+"\r\nจงอ่านเถิด และพระเจ้าของเจ้านั้นผู้ทรงใจบุญยิ่ง\r\n\r\n"+"الَّذِي عَلَّمَ بِالْقَلَمِ"+"\r\nผู้ทรงสอนการใช้ปากกา\r\n\r\n"+
                      "عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ "+"\r\nผู้ทรงสอนมนุษย์ในสิ่งที่เขาไม่รู้\r\n\r\n"+"كَلَّا إِنَّ الْإِنسَانَ لَيَطْغَىٰ"+"\r\nมิใช่เช่นนั้นแท้จริงมนุษย์นั้น ย่อมจะละเมิดขอบเขต\r\n\r\n"+"أَن رَّآهُ اسْتَغْنَىٰ"+"\r\nเนื่องเพราะเขาคิดว่าเขาพอเพียงแล้ว\r\n\r\n"+
                      "إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ"+"\r\nแท้จริงยังพระเจ้าของเจ้าเท่านั้นคือ การกลับไป\r\n\r\n"+"أَرَأَيْتَ الَّذِي يَنْهَىٰ"+"\r\nเจ้าเห็นแล้วมิใช่หรือ ผู้ที่ขัดขวาง\r\n\r\n"+"عَبْدًا إِذَا صَلَّىٰ "+"\r\nบ่าวคนหนึ่ง เมื่อเขากำลังละหมาด\r\n\r\n"+
                      "أَرَأَيْتَ إِن كَانَ عَلَى الْهُدَىٰ"+"\r\nเจ้าคิดบ้างไหมว่า หากบ่าวผู้นั้นอยู่บนแนวทางที่ถูกต้อง\r\n\r\n"+"أَوْ أَمَرَ بِالتَّقْوَىٰ"+"\r\nหรือใช้ให้ผู้คนมีความยำเกรง\r\n\r\n"+"أَرَأَيْتَ إِن كَذَّبَ وَتَوَلَّىٰ"+"\r\nเจ้าคิดบ้างไหมว่า หากเขาปฏิเสธ และผินหลังให้\r\n\r\n"+
                      "أَلَمْ يَعْلَم بِأَنَّ اللَّهَ يَرَىٰ"+"\r\nเขาไม่รู้ดอกหรือว่า แท้จริงอัลลอฮฺ นั้นทรงเห็น\r\n\r\n"+"كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ"+"\r\nมิใช่เช่นนั้น ถ้าเขายังไม่หยุดยั้ง เราจะจิกเขาที่ขม่อมอย่างแน่นอน\r\n\r\n"+
                      "نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ"+"\r\nขม่อมที่โกหกที่ประพฤติชั่ว\r\n\r\n"+"فَلْيَدْعُ نَادِيَهُ"+"\r\nแล้วให้เขาเรียกที่ประชุมของเขา\r\n\r\n"+"سَنَدْعُ الزَّبَانِيَةَ"+"\r\nเราก็จะเรียกผู้คุมนรก\r\n\r\n"+
                      "كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِب"+"\r\nมิใช่เช่นนั้น เจ้าอย่าได้เชื่อฟังมัน แต่จงสุญูด และเข้า";

        strMess[20] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَالتِّينِ وَالزَّيْتُونِ "+"\r\nขอสาบานด้วยต้นมะเดื่อและต้นมะกอก\r\n\r\n"+"وَطُورِ سِينِينَ"+"\r\nและด้วยภูเขาฎูรซีนาย\r\n\r\n"+
                      "وَهَٰذَا الْبَلَدِ الْأَمِينِ"+"\r\nและด้วยเมืองนี้ที่ปลอดภัย\r\n\r\n"+"لَقَدْ خَلَقْنَا الْإِنسَانَ فِي أَحْسَنِ تَقْوِيمٍ "+"\r\nโดยแน่นอนเราได้บังเกิดมนุษย์มาในรูปแบบที่สวยงามยิ่ง\r\n\r\n"+
                      "ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ"+"\r\nแล้วเราได้ให้เขากลับสู่สภาพที่ตกต่ำยิ่ง\r\n\r\n"+ "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ"+"\r\nนอกจากบรรดาผู้ศรัทธาและประกอบสิ่งดีงามทั้งหลาย โดยที่สำหรับพวกเขาจะได้รับรางวัลอย่างไม่มีที่สิ้นสุด\r\n\r\n"+
                      "فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ"+"\r\nดังนั้น อะไรเล่าเขาจึงปฏิเสธเจ้า หลังจากนี้เกี่ยวกับการตอบแทน\r\n\r\n"+"أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ"+"\r\nมิใช่อัลลอฮฺดอกหรือ เป็นผู้ตัดสินที่ดีเยี่ยมในหมู่ผู้ตัดสินทั้งหลาย";

        strMess[21] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ"+"\r\nเรามิได้เปิดหัวอกของเจ้าแก่เจ้าดอกหรือ ?\r\n\r\n"+
                      "وَوَضَعْنَا عَنكَ وِزْرَكَ"+"\r\nและเราได้ปลดเปลื้องภาระหนักของเจ้าออกจากเจ้าแล้ว\r\n\r\n"+"الَّذِي أَنقَضَ ظَهْرَكَ"+"\r\nซึ่งเป็นภาระหนักอึ้งบนหลังของเจ้า\r\n\r\n"+"وَرَفَعْنَا لَكَ ذِكْرَكَ "+"\r\nและเราได้ยกย่องให้แก่เจ้าแล้ว ซึ่งการกล่าวถึงเจ้า\r\n\r\n"+
                      "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا "+"\r\nฉะนั้นแท้จริงหลังจากความยากลำบากก็จะมีความง่าย\r\n\r\n"+"إِنَّ مَعَ الْعُسْرِ يُسْرًا"+"\r\nแท้จริงหลังจากความยากลำบากก็จะมีความง่าย\r\n\r\n"+
                      "فَإِذَا فَرَغْتَ فَانصَبْ"+"\r\nดังนั้นเมื่อเจ้าเสร็จสิ้น (จากงานหนึ่งแล้ว) ก็จงลำบากต่อไป\r\n\r\n"+"وَإِلَىٰ رَبِّكَ فَارْغَب"+"\r\nและยังพระเจ้าของเจ้าเท่านั้นก็จงมุ่งปรารถนาเถิด";

        strMess[22] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَالضُّحَىٰ"+"\r\nขอสาบานด้วยเวลาสาย\r\n\r\n"+"وَاللَّيْلِ إِذَا سَجَىٰ"+"\r\nและด้วยเวลากลางคืนเมื่อมันมืด และสงัดเงียบ\r\n\r\n"+
                      "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ"+"\r\nพระเจ้าของเจ้ามิได้ทรงทอดทิ้งเจ้า และมิได้ทรงโกรธเคืองเจ้า\r\n\r\n"+"وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ "+"\r\nและแน่นอนเบื้องปลายเป็นการดียิ่งแก่เจ้ากว่าเบื้องต้น\r\n\r\n"+
                      "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ "+"\r\nและความแน่นอนพระเจ้าของเจ้าจะให้แก่เจ้าจนกว่าจะพอใจ\r\n\r\n"+ "أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ"+"\r\nพระองค์มิได้ทรงพบเจ้าเป็นกำพร้าแล้วทรงให้ที่พึ่งดอกหรือ ?\r\n\r\n"+
                      "وَوَجَدَكَ ضَالًّا فَهَدَىٰ"+"\r\nและทรงพบเจ้าระเหเร่ร่อน แล้วก็ทรงชี้แนะทาง (แก่เจ้า) ดอกหรือ ?\n\r\n"+"وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ"+"\r\nและทรงพบเจ้าเป็นผู้ขัดสน แล้วให้มั่งคั่ง (แก่) เจ้าดอกหรือ ?\r\n\r\n"+
                      "فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ"+"\r\nดังนั้นส่วนเด็กกำพร้าเจ้าอย่าข่มขี่\r\n\r\n"+"وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ"+"\r\nและส่วนผู้เอ่ยขอนั้น เจ้าอย่าตวาดขับไล่\r\n\r\n"+
                      "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ "+"\r\nและส่วนความโปรดปรานแห่งพระเจ้าของเจ้านั้น เจ้าจงแสดงออก";

        strMess[23] = "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ "+ "\r\nด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ\r\n\r\n"+"يس"+"\r\nยาซีน\r\n"+"وَالْقُرْآنِ الْحَكِيمِ"+"\r\nขอสาบานด้วยอัลกุรอานที่มีคำสั่งอันรัดกุม\r\n\r\n"+
                      "إِنَّكَ لَمِنَ الْمُرْسَلِينَ"+"\r\nแท้จริง เจ้าเป็นผู้หนึ่งในหมู่ผู้ถูกส่งมาอย่างแน่นอน\r\n\r\n"+"عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ"+"\r\n(เป็นผู้) อยู่บนแนวทางอันเที่ยงธรรม\r\n\r\n"+
                      "تَنزِيلَ الْعَزِيزِ الرَّحِيمِ"+"\r\nอัลกุรอานนี้เป็นการประทานลงมาจากพระผู้ทรงอำนาจ ผู้ทรงเมตตาเสมอ\r\n\r\n"+"لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ "+"\r\nเพื่อเจ้าจะได้ตักเตือนกลุ่มชนหนึ่งซึ่งบรรพบุรุษของพวกเขามิได้ถูกตักเตือนมาก่อนดังนั้น พวกเขาจึงไม่สนใจ\r\n\r\n"+
                      "لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ"+"\r\nโดยแน่นอน พระประกาศิตได้เป็นที่สมจริงแล้วแก่ส่วนมากของพวกเขา เพราะพวกเขาไม่ศรัทธา\r\n\r\n"+
                      "إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى الْأَذْقَانِ فَهُم مُّقْمَحُونَ"+"\r\nแท้จริงเราได้คล้องพันธนาการที่คอของพวกเขา มันจึงห้อยลงมาที่คางของพวกเขา ดังนั้น (ศรีษะของ)พวกเขาจึงเงยขึ้น\r\n\r\n"+
                      "وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ"+"\r\nและเราได้ทำเครื่องกีดขวางไว้ข้างหน้าพวกเขา และเครื่องกีดขวางไว้ข้างหลังพวกเขา\r\n\r\n"+
                      "وَسَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ"+"\r\nและมีผลเท่ากันแก่พวกเขา เจ้าจะตักเตือนพวกเขาหรือไม่ตักเตือนพวกเขาก็ตาม พวกเขาก็จะไม่ศรัทธา\r\n\r\n"+
                      "إِنَّمَا تُنذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ "+"\r\nแท้จริงเจ้าเพียงแต่ตักเตือนผู้ที่ปฏิบัติตามข้อตักเตือนเท่านั้น และเขาเกรงกลัวพระผู้ทรงกรุณาปรานีโดยทางลับ ดังนั้น จงแจ้งข่าวดีแก่เขาด้วยการอภัยโทษและรางวัลอันมีเกียรติ\r\n\r\n"+
                      "إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُّبِينٍ "+"\r\nแท้จริงเราเป็นผู้ให้คนตายกลับมีชีวิตขึ้น และเราบันทึกสิ่งที่พวกเขาได้ประกอบไว้แต่ก่อน และร่องรอยของพวกเขาและทุกสิ่งนั้น เราได้รวบรวมไว้อย่างครบถ้วนในบันทึกอันชัดแจ้ง\r\n\r\n"+
                      "وَاضْرِبْ لَهُم مَّثَلًا أَصْحَابَ الْقَرْيَةِ إِذْ جَاءَهَا الْمُرْسَلُونَ"+"\r\nและจงเล่าเรื่องชาวเมือง (อันฏอกียะฮฺ) แก่พวกเขา เมื่อมีทูตหลายคนมายังเมืองนั้น\r\n\r\n"+
                      "إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُم مُّرْسَلُونَ"+"\r\nเมื่อเราส่งทูตสองคนไปยังพวกเขา พวกเขาได้ปฏิเสธเขาทั้งสอง ดังนั้น เรา (อัลลอฮฺ) จึงเพิ่มพลังด้วยการส่งทูตคนที่สามแล้วพวกเขา (บรรดาทูต) ได้กล่าวว่า “แท้จริงพวกเราถูกส่งมายังพวกท่าน“\r\n\r\n"+
                      "قَالُوا مَا أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَا أَنزَلَ الرَّحْمَٰنُ مِن شَيْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ"+"\r\nพวกเขา (ชาวเมือง) กล่าวว่า “พวกท่านมิใช่ใครอื่น นอกจากเป็นสามัญชนเช่นเดียวกับพวกเรา และพระผู้ทรงกรุณาปรานีมิได้ประทานสิ่งใดลงมา พวกท่านมิได้เป็นอื่นใดนอกจากกล่าวเท็จ”\r\n\r\n"+
                      "قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ"+"\r\nพวกเขา (บรรดาทูต) กล่าวว่า “พระเจ้าของเราทรงรู้ดียิ่งว่า แท้จริงเราถูกส่งมายังพวกท่านอย่างแน่นอน\r\n\r\n"+"وَمَا عَلَيْنَا إِلَّا الْبَلَاغُ الْمُبِينُ"+"\r\nและไม่มีหน้าที่อื่นใดแก่พวกเรานอกจากการประกาศเชิญชวนอันชัดแจ้งเท่านั้น”\r\n\r\n"+
                      "قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ"+"\r\nพวกเขากล่าวว่า “แท้จริงพวกเราถือเป็นลางร้ายต่อพวกท่าน หากพวกท่านไม่ยอมหยุดยั้ง เราจะเอาหินขว้างพวกท่านจนตายและแน่นอน การลงโทษอันเจ็บปวดจากพวกเราจะประสบแก่พวกท่าน”\r\n\r\n"+
                      "قَالُوا طَائِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ "+"\r\nพวกเขา (บรรดาทูต) กล่าวว่า “ลางร้ายของพวกท่านเพราะพวกท่านเอง พวกท่านได้ถูกตักเตือนมาก่อนแล้วมิใช่หรือ ? เปล่าดอกพวกท่านเป็นหมู่ชนผู้ฝ่าฝืนต่างหาก”\r\n\r\n"+
                      "وَجَاءَ مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ"+"\r\nและมีชายคนหนึ่งจากสุดหัวเมืองได้มาอย่างรีบเร่ง\r\n\r\n"+"اتَّبِعُوا مَن لَّا يَسْأَلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ"+"\r\nพวกท่านจงปฏิบัติตามผู้ที่มิได้เรียกร้องรางวัลใด ๆ จากพวกท่าน\r\n\r\n"+
                      "وَمَا لِيَ لَا أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ"+"\r\nและทำไมเล่าฉันจะไม่เคารพภักดีผู้ทรงบังเกิดฉัน และยังพระองค์เท่านั้นที่พวกท่านจะถูกนำกลับไป\r\n\r\n"+
                      "َأَتَّخِذُ مِن دُونِهِ آألِهَةً إِن يُرِدْنِ الرَّحْمَٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّي شَفَاعَتُهُمْ شَيْئًا وَلَا يُنقِذُون"+"\r\nจะให้ฉันยึดถือพระเจ้าอื่นใดนอกจากพระองค์กระนั้นหรือ? หากพระผู้ทรงกรุณาปรานี ทรงประสงค์จะก่อความทุกข์ยากแก่ฉัน การชะฟาอะฮฺของพวกเขาจะไม่ก่อประโยชน์อันใดแก่ฉันเลยและพวกเขาก็จะช่วยฉันให้รอดพ้น(จากการลงโทษ) ไม่ได้เลย\r\n\r\n"+
                      "إِنِّي إِذًا لَّفِي ضَلَالٍ مُّبِينٍ"+"\r\nแท้จริง เมื่อนั้นฉันจะอยู่ในการหลงผิดอย่างชัดแจ้ง\r\n\r\n"+"إِنِّي آمَنتُ بِرَبِّكُمْ فَاسْمَعُونِ"+"\r\nแท้จริงฉันศรัทธาต่อพระเจ้าของพวกท่าน ดังนั้น พวกท่านจงฟังฉันซิ!”\r\n\r\n"+
                      "قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ "+"\r\nเขากล่าวว่า “โอ้ มาตรว่าหมู่ชนของฉันได้รู้ (สภาพของฉัน)\r\n\r\n"+"بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ"+"\r\nถึงการที่พระเจ้าของฉันทรงอภัยให้แก่ฉัน และทรงทำให้ฉันอยู่ในหมู่ผู้มีเกียรติ”\r\n\r\n"+
                      "وَمَا أَنزَلْنَا عَلَىٰ قَوْمِهِ مِن بَعْدِهِ مِن جُندٍ مِّنَ السَّمَاءِ وَمَا كُنَّا مُنزِلِينَ"+"\r\nและเรามิได้ส่งไพร่พลลงมาจากฟากฟ้าแก่หมู่ชนของเขาหลังจากเขา และเราก็มิใช่เป็นผู้ส่งพวกเขาลงมา\r\n\r\n"+
                      "إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ خَامِدُونَ"+"\r\nแล้วเมื่อนั้นพวกเขาก็ดับเงียบ\r\n\r\n"+"يَا حَسْرَةً عَلَى الْعِبَادِ ۚ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ "+"\r\nโอ้ อนิจจาต่อปวงบ่าว ไม่มีร่อซูลคนใดมายังพวกเขา เว้นแต่พวกเขาได้เย้ยหยันเขา\r\n\r\n"+
                      "أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ "+"\r\nพวกเขามิได้พิจารณาดอกหรือว่า กี่ศตวรรษมาแล้วก่อนหน้าพวกเขาเราได้ทำลายโดยที่เขาเหล่านั้นมิได้กลับมายังพวกเขา\r\n\r\n"+"وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ"+"\r\nและแต่ละคนในพวกเขาทั้งหมดจะถูกนำมาปรากฏตัวต่อหน้าเรา\r\n\r\n"+
                      "وَآيَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ"+"\r\nและสัญญาณหนึ่งสำหรับพวกเขาก็คือ แผ่นดินที่แห้งแล้งเราได้ให้มันมีชีวิตชีวาขึ้นมาและเราได้นำเมล็ดพืชออกมาจากมัน ซึ่งส่วนหนึ่งจากเมล็ดพืชนั้นพวกเขาใช้กิน\r\n\r\n"+
                      "وَجَعَلْنَا فِيهَا جَنَّاتٍ مِّن نَّخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ"+"\r\nและเราได้ทำให้มีในแผ่นดินนั้นเรือกสวนมากหลาย จากอินทผลัมและองุ่น และเราได้ทำมีตาน้ำในนั้น\r\n\r\n"+
                      "لِيَأْكُلُوا مِن ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ "+"\r\nเพื่อพวกเขาจะได้กินผลไม้ของมันและจากสิ่งที่มือของพวกเขาได้กระทำมันขึ้นแล้วพวกเขาจะไม่ขอบคุณกระนั้นหรือ ?\r\n\r\n"+
                      "سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنبِتُ الْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ"+"\r\nมหาบริสุทธิ์ยิ่งแด่พระผู้ทรงสร้างทุกสิ่งทั้งหมดเป็นคู่ ๆ จากสิ่งที่แผ่นดินได้ (ให้มัน) งอกเงยขึ้นมา และจากตัวของพวกเขาเองและจากสิ่งที่พวกเขาไม่รู้\r\n\r\n"+
                      "وَآيَةٌ لَّهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُم مُّظْلِمُونَ"+"\r\nและสัญญาณหนึ่งสำหรับพวกเขาก็คือกลางคืน เราได้ถอนกลางวันออกจากมัน แล้วพวกเขาก็อยู่ในความมืด\r\n\r\n"+"وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ"+"\r\nและดวงอาทิตย์โคจรตามวิถีของมัน นั่นคือ การกำหนดของพระผู้ทรงอำนาจ ผู้ทรงรอบรู้\r\n\r\n"+
                      "وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ"+"\r\nและดวงจันทร์นั้น เราได้กำหนดให้มันโคจรตามตำแหน่ง จนกระทั่งมันได้กลายมาเป็นเช่นกิ่งอินทผลัมแห้ง\r\n\r\n"+
                      "لَا الشَّمْسُ يَنبَغِي لَهَا أَن تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ ۚ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ"+"\r\nดวงอาทิตย์ก็ไม่สมควร (อนุมัติ) แก่มันที่จะไล่ตามใกล้ดวงจันทร์ และกลางคืนก็จะไม่ล้ำหน้ากลางวัน และทั้งหมดนั้นจะเวียนว่ายอยู่ในจักรราศี\r\n\r\n"+
                      "وَآيَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُونِ"+"\r\nและสัญญาณหนึ่งสำหรับพวกเขาก็คือ เราได้บรรทุกลูกหลานของพวกเขาไว้ในเรือจนเต็ม\r\n\r\n"+"وَخَلَقْنَا لَهُم مِّن مِّثْلِهِ مَا يَرْكَبُونَ"+"\r\nและเราได้สร้างทำนองเดียวกันนี้ (เรือใหญ่) แก่พวกเขา เพื่อให้พวกเขาขับขี่\r\n\r\n"+
                      "وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ"+"\r\nและถ้าเราประสงค์เราก็จะจมพวกเขาเสีย แล้วจะไม่มีผู้ร้องตะโกนเพื่อขอความช่วยเหลือให้แก่เขา และพวกเขาก็จะไม่ถูกช่วยให้รอดพ้น (จากการจมน้ำตาย) ด้วย\r\n\r\n"+"إِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا إِلَىٰ حِينٍ"+"\r\nเว้นแต่ด้วยความเมตตาจากเรา และความเพลิดเพลินชั่วระยะหนึ่ง\r\n\r\n"+
                      "وَإِذَا قِيلَ لَهُمُ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ"+"\r\nและเมื่อได้มีเสียงกล่าวแก่พวกเขาว่า “จงระวังสิ่งที่อยู่ข้างหน้าพวกเจ้า และสิ่งที่อยู่ข้างหลังพวกเจ้า เพื่อพวกเจ้าจะได้รับความเมตตา”\r\n\r\n"+
                      "وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ"+"\r\nและไม่มีสัญญาณใดในบรรดาสัญญาณของพระเจ้าของพวกเขาได้มีมายังพวกเขาเว้นแต่พวกเขาจะผินหลังให้แก่ สัญญาณนั้น ๆ\r\n\r\n"+
                      "وَإِذَا قِيلَ لَهُمْ أَنفِقُوا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَنُطْعِمُ مَن لَّوْ يَشَاءُ اللَّهُ أَطْعَمَهُ إِنْ أَنتُمْ إِلَّا فِي ضَلَالٍ مُّبِينٍ"+"\r\nและเมื่อมีเสียงกล่าวแก่พวกเขาว่า “จงบริจาคจากสิ่งที่อัลลอฮฺทรงประทานเป็นปัจจัยยังชีพแก่พวกเจ้า” บรรดาผู้ปฏิเสธศรัทธาได้กล่าวแก่บรรดาผู้ศรัทธาว่า “เราจะให้อาหารแก่ผู้ที่หากอัลลอฮฺทรงประสงค์ก็จะให้อาหารแก่เขากระนั้นหรือ ? “พวกท่านมิใช่อื่นใดเลยนอกจากอยู่ในการหลงผิดอย่างชัดแจ้ง “\r\n\r\n"+
                      "وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ"+"\r\nและพวกเขากล่าวว่า “เมื่อใดเล่าสัญญานี้จะเกิดขึ้น หากพวกท่านเป็นผู้สัตย์จริง”\r\n\r\n"+"مَا يَنظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ "+"\r\nพวกเขามิได้คอยสิ่งใดเลยนอกจากเสียงกัมปนาทเพียงครั้งเดียว ซึ่งจะคร่าชีวิต พวกเขาในขณะที่พวกเขาโต้เถียงกันอยู่\r\n\r\n"+
                      "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَىٰ أَهْلِهِمْ يَرْجِعُونَ"+"\r\nแล้วพวกเขาก็ไม่สามารถจะสั่งเสียอันใด และพวกเขาก็ไม่ทันจะกลับไปยังครอบครัวของพวกเขาได้\r\n\r\n"+"وَنُفِخَ فِي الصُّورِ فَإِذَا هُم مِّنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ"+"\r\nและสังข์ก็จะถูกเป่าขั้น ทันใดนั้นพวกเขาจะออกจากหลุมฝังศพ แล้วพวกเขาก็รีบรุดไปยังพระเจ้าของพวกเขา\r\n\r\n"+
                      "قَالُوا يَا وَيْلَنَا مَن بَعَثَنَا مِن مَّرْقَدِنَا ۜ ۗ هَٰذَا مَا وَعَدَ الرَّحْمَٰنُ وَصَدَقَ الْمُرْسَلُونَ"+"\r\nพวกเขากล่าวว่า “โอ้ความหายนะที่ประสบแก่เรา ! ใครเล่าที่ให้เราฟื้นขึ้นจากที่นอนของเรา (กุบูร)” (จะมีเสียงกล่าวขึ้นว่า) ”นี่แหละคือสิ่งที่พระผู้ทรงกรุณาปรานีได้ทรงสัญญาไว้ และบรรดาร่อซูลได้กล่าวสมจริงแล้ว“\r\n\r\n"+
                      "إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ"+"\r\nไม่มีอะไรดอกนอกจากเสียงกัมปนาทเพียงครั้งเดียว ทันใดนั้นพวกเขาทั้งหมดก็จะถูกนำมาปรากฏต่อหน้าเรา\r\n\r\n"+
                      "فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ"+"\r\nในวันนั้นไม่มีชีวิตใด (ผู้ใด) จะถูกอยุติธรรมแต่ประการใด และพวกเจ้าจะไม่ได้รับการตอบแทน นอกจากสิ่งที่พวกเจ้าได้ปฏิบัติไว้\r\n\r\n"+"إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ"+"\r\nแท้จริง ในวันนั้นชาวสวรรค์จะอยู่ในกิจกรรมอันสุขสำราญ\r\n\r\n"+
                      "هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ"+"\r\nพวกเขาและคู่ครองของพวกเขาจะอยู่ภายใต้ร่มเงา นอนเอกเขนกอยู่บนเก้าอี้นวม\r\n\r\n"+"لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُم مَّا يَدَّعُونَ"+"\r\nสำหรับพวกเขาในสวนสวรรค์นั้นจะมีผลไม้ (หลากชนิด) และสำหรับพวกเขาจะมีสิ่งที่พวกเขาต้องการ\r\n\r\n"+
                      "سَلَامٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ"+"\r\n“ความศานติ!” พระดำรัสหนึ่งจากพระเจ้าผู้ทรงเมตตาเสมอ\r\n\r\n"+"وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ"+"\r\n“โอ้บรรดาอาชญากรทั้งหลายเอ๋ย! วันนี้พวกเจ้าจงถอยห่างออกไปให้พ้น\r\n\r\n"+
                      "أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَن لَّا تَعْبُدُوا الشَّيْطَانَ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ"+"\r\nข้ามิได้บัญชาพวกเจ้าดอกหรือ โอ้ลูกหลานของอาดัมเอ๋ย! ว่าพวกเจ้าอย่าได้เคารพบูชาชัยฏอนมารร้าย แท้จริงมันนั้นเป็นศัตรูตัวฉกาจของพวกเจ้า\r\n\r\n"+"وَأَنِ اعْبُدُونِي ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ"+"\r\nและพวกเจ้าจงเคารพภักดีต่อข้า นี่คือแนวทางอันเที่ยงแท้\r\n\r\n"+
                      "وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا تَعْقِلُونَ "+"\r\nและโดยแน่นอน มันได้ทำให้หมู่ชนจำนวนมากของพวกเจ้าหลงทาง ทำไมพวกเจ้าจึงไม่ใช้สติปัญญาใคร่ครวญเล่า?\r\n\r\n"+"هَٰذِهِ جَهَنَّمُ الَّتِي كُنتُمْ تُوعَدُونَ"+"\r\nนี่คือนรกญะฮันนัม ซึ่งพวกเจ้าถูกสัญญาไว้\r\n\r\n"+
                      "اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ "+"\r\nวันนี้พวกเจ้าจะเข้าไปลิ้มรสมัน เนื่องเพราะพวกเจ้าปฏิเสธ\r\n\r\n"+"الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا يَكْسِبُونَ "+"\r\nวันนี้เราจะปิดผนึกปากของพวกเขาและมือของพวกเขาจะพูดแก่เรา และเท้าของพวกเขาจะเป็นพยานตามที่พวกเขาได้ปฏิบัติไว้\r\n\r\n"+
                      "وَلَوْ نَشَاءُ لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّىٰ يُبْصِرُونَ "+"\r\nและหากเราประสงค์ เราก็จะทำให้ตาของพวกเขาบอดลง แล้วพวกเขาก็จะคลำหาทาง แต่พวกเขาจะเห็นได้อย่างไร?\r\n\r\n"+"وَلَوْ نَشَاءُ لَمَسَخْنَاهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيًّا وَلَا يَرْجِعُونَ"+"\r\nและหากเราประสงค์ เราก็จะแปลงรูปของพวกเขาให้อยู่กับที่ของพวกเขา แล้วพวกเขาก็ไม่อาจจะไปข้างหน้าได้และก็ไม่อาจจะถอยกลับได้\r\n\r\n"+
                      "وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ"+"\r\nและผู้ใดที่เราทำให้เขามีอายุยืนนานเราจะให้กลับคืนสู่สภาพเมื่อตอนแรกเกิดแล้วพวกเขาไม่ไช้สติปัญญาใคร่ครวญบ้างหรือ?\r\n\r\n"+"وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنبَغِي لَهُ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُّبِينٌ "+"\r\nเรามิได้สอนกวีนิพนธ์แก่เขา (มุฮัมมัด) และไม่เหมาะสมแก่เขาที่จะเป็นกวีคัมภีร์นี้มิใช่อื่นใดเลย นอกจากเป็นข้อตักเตือนและเป็นคัมภีร์อันชัดแจ้ง\r\n\r\n"+
                      "لِّيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ"+"\r\nเพื่อตักเตือนผู้ที่มีชีวิต และเพื่อข้อตักเตือนนั้นเป็นหลักฐานยืนยันแก่บรรดาผู้ปฏิเสธศรัทธา\r\n\r\n"+"أَوَلَمْ يَرَوْا أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ "+"\r\nและพวกเขามิได้พิจารณาดูดอกหรือเราได้สร้างปศุสัตว์ขึ้นมาเพื่อพวกเขาจากสิ่งที่มือของเราได้ทำขึ้น แล้วพวกเขาก็ได้ครอบครองมัน\r\n\r\n"+
                      "وَذَلَّلْنَاهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ"+"\r\nและเราได้ทำให้มันยอมจำนนแก่พวกเขา ดังนั้น บางชนิดมันก็เป็นพาหนะแก่พวกเขา และบางชนิดพวกเขาก็ใช้กินเป็นอาหาร\r\n\r\n"+"وَلَهُمْ فِيهَا مَنَافِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ "+"\r\nและในตัวมันนั้นมีประโยชน์มากหลายและเครื่องดื่มสำหรับพวกเขา แล้วพวกเขาจะยังไม่ขอบคุณอีกหรือ?\r\n\r\n"+
                      "وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لَّعَلَّهُمْ يُنصَرُونَ"+"\r\nและพวกเขาได้ยึดถือเอาพระเจ้ามากหลาย (เป็นที่เคารพสักการะ) อื่นจากอัลลอฮฺหวังว่าพวกเขาจะได้รับความช่วยเหลือ (จากมัน)\r\n\r\n"+"لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ"+"\r\nพวกมันไม่สามารถช่วยเหลือพวกเขาได้ พวกเขาจะถูกนำมาปรากฏตัวเป็นกลุ่ม ๆ เพื่อพวกมัน\r\n\r\n"+
                      "فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ"+"\r\nดังนั้น อย่าได้ให้คำพูดของพวกเขาเป็นที่เสียใจแก่เจ้า แท้จริงเรารู้ดีถึงสิ่งที่พวกเขาปิดบัง และสิ่งที่พวกเขาเปิดเผย\r\n\r\n"+"أَوَلَمْ يَرَ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ"+"\r\nมนุษย์มิได้พิจารณาดูดอกหรือว่าเราได้บังเกิดเขามาจากน้ำอสุจิ แล้วจงดูซิ เขาได้กลายเป็นคู่ปรปักษ์ตัวฉกาจ\r\n\r\n"+
                      "وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ ۖ قَالَ مَن يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ"+"\r\nและเขาได้ยกอุทาหรณ์เปรียบเทียบแก่เรา และเขาได้ลืมต้นกำเนิดของเขา เขากล่าวว่า “ใครเล่าจะให้กระดูกมีชีวิตขึ้นมาอีกในเมื่อมันเป็นผุยผงไปแล้ว”\r\n\r\n"+ "قُلْ يُحْيِيهَا الَّذِي أَنشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ"+"\r\nจงกล่าวเถิดมุฮัมมัด “พระผู้ทรงให้กำเนิดมันครั้งแรกนั้น ย่อมจะทรงให้มันมีชีวิตขึ้นมาอีก และพระองค์เป็นผู้ทรงรอบรู้การบังเกิดทุกสิ่ง\r\n\r\n"+
                      "الَّذِي جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنتُم مِّنْهُ تُوقِدُونَ"+"\r\nผู้ทรงทำให้มีไฟสำหรับพวกเจ้าจากต้นไม้เขียวสด (แล้วจงดูซิ) พวกเจ้าก็ได้จุดมันจากเชื้อไฟนั้น\r\n\r\n"+"أَوَلَيْسَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِقَادِرٍ عَلَىٰ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَىٰ وَهُوَ الْخَلَّاقُ الْعَلِيمُ "+"\r\nพระองค์ผู้ทรงสร้างชั้นฟ้าทั้งหลายและแผ่นดิน จะไม่ทรงสามารถที่จะสร้างเช่นเดียวกับพวกเขากระนั้นหรือ ? แน่นอน และพระองค์เป็นผู้ทรงสร้างที่ยิ่งใหญ่ ผู้ทรงรอบรู้\r\n\r\n"+
                      "إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَن يَقُولَ لَهُ كُن فَيَكُونُ"+"\r\nแท้จริงพระบัญชาของพระองค์ เมื่อทรงประสงค์สิ่งใด พระองค์ก็จะตรัสแก่มันว่า “จงเป็น” แล้วมันก็จะเป็นขึ้นมา\r\n\r\n"+"فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ"+"\r\nดังนั้น มหาบริสุทธิ์ยิ่งแด่พระองค์ซึ่งในพระหัตถ์ของพระองค์มีอำนาจเหนือทุกสิ่งและยังพระองค์เท่านั้นที่พวกเจ้าจะถูกนำกลับไป";


        return strMess;
    }



    public int[] icon() {

        int[] intIcon = {R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii,R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii,R.drawable.ii
        ,R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii,R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii, R.drawable.ii};

        return intIcon;
    }



}//Main class
